<a href="https://colab.research.google.com/github/KrishnaGande/Ineuron-Learning/blob/main/Pandas_file_read_and_write_operation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

# file Read Write operation

In [ ]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=4)

In [ ]:
import pandas as pd

draft1 = pd.read_csv(r'/content/test.tsv',sep='\t')    # Supply the file name (path)
type(draft1)
draft1.tail()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [ ]:
draft2 = pd.read_table('/content/ex1.csv',sep=',')  # Read a tsv into a DataFrame

draft2.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
df = pd.read_csv('/content/ex1.csv',header=None)
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [ ]:
pd.read_table('/content/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
pd.read_csv('/content/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
df =pd.read_csv('/content/ex2.csv', names=['k','l', 'm', 'n', 'o', 'p'])
df

   k   l   m   n      o   p
0  1   2   3   4  hello NaN
1  5   6   7   8  world NaN
2  9  10  11  12    foo NaN

In [ ]:

parsed = pd.read_csv('csv_mindex.csv',index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
result = pd.read_csv('ex5.csv')
result
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
result = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
draft3 = pd.read_excel('/content/ex1.xlsx',sheet_name = 'sudh') # Name of sheet to read from

draft3.head(6)

    ehsja Unnamed: 1 Unnamed: 2 Unnamed: 3
0  snsjsj      nxjss      dsmsk       sksk
1     NaN     skszkk        NaN        NaN
2  ;A;SLS        NaN     SKSK,X       ,SKS

In [ ]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

#BB_data[0].ix[:, 0:20].head(5)      # Check 5 rows (10 columns only)
df=BB_data[0]
df

      Rk          Player Pos Age   Tm   G  ...  AST  STL BLK  TOV   PF   PTS
0      1      Quincy Acy  PF  24  NYK  68  ...   68   27  22   60  147   398
1      2    Jordan Adams  SG  20  MEM  30  ...   16   16   7   14   24    94
2      3    Steven Adams   C  21  OKC  70  ...   66   38  86   99  222   537
3      4     Jeff Adrien  PF  28  MIN  17  ...   15    4   9    9   30    60
4      5   Arron Afflalo  SG  29  TOT  78  ...  129   41   7  116  167  1035
..   ...             ...  ..  ..  ...  ..  ...  ...  ...  ..  ...  ...   ...
670  490  Thaddeus Young  PF  26  TOT  76  ...  173  124  25  117  171  1071
671  490  Thaddeus Young  PF  26  MIN  48  ...  135   86  17   75  115   685
672  490  Thaddeus Young  PF  26  BRK  28  ...   38   38   8   42   56   386
673  491     Cody Zeller   C  22  CHO  62  ...  100   34  49   62  156   472
674  492    Tyler Zeller   C  25  BOS  82  ...  113   18  52   76  205   833

[675 rows x 30 columns]

In [ ]:
df.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [ ]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [ ]:
titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic_train[["Name","Pclass"]].head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [ ]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
url1='https://raw.githubusercontent.com/akhil12028/Bank-Marketing-data-set-analysis/master/bank-additional-full.csv'
bank_ds=pd.read_csv(url1,sep=';')

In [ ]:
bank_ds.head()

   age        job  marital  ... euribor3m nr.employed   y
0   56  housemaid  married  ...     4.857      5191.0  no
1   57   services  married  ...     4.857      5191.0  no
2   37   services  married  ...     4.857      5191.0  no
3   40     admin.  married  ...     4.857      5191.0  no
4   56   services  married  ...     4.857      5191.0  no

[5 rows x 21 columns]

In [ ]:
bank_ds.tail(2)

       age         job  marital  ... euribor3m nr.employed    y
41186   44  technician  married  ...     1.028      4963.6  yes
41187   74     retired  married  ...     1.028      4963.6   no

[2 rows x 21 columns]

In [ ]:
bank_ds.dtypes

age                 int64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
y                  object
dtype: object

In [ ]:
bank_ds.isnull()

         age    job  marital  ...  euribor3m  nr.employed      y
0      False  False    False  ...      False        False  False
1      False  False    False  ...      False        False  False
2      False  False    False  ...      False        False  False
3      False  False    False  ...      False        False  False
4      False  False    False  ...      False        False  False
...      ...    ...      ...  ...        ...          ...    ...
41183  False  False    False  ...      False        False  False
41184  False  False    False  ...      False        False  False
41185  False  False    False  ...      False        False  False
41186  False  False    False  ...      False        False  False
41187  False  False    False  ...      False        False  False

[41188 rows x 21 columns]

In [ ]:
bank_ds.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'month', 'day_of_week', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y'],
      dtype='object')

In [ ]:
bank_ds1=pd.read_csv(url1,sep=';',names=['age', 'job', 'marital', 'Education', 'default', 'housing', 'loan',
       'contact', 'month', 'day_of_week', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y'])

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (0,10,11,12,13,15,16,17,18,19) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [ ]:
bank_ds1

       age          job  marital  ...  euribor3m  nr.employed    y
0      age          job  marital  ...  euribor3m  nr.employed    y
1       56    housemaid  married  ...      4.857         5191   no
2       57     services  married  ...      4.857         5191   no
3       37     services  married  ...      4.857         5191   no
4       40       admin.  married  ...      4.857         5191   no
...    ...          ...      ...  ...        ...          ...  ...
41184   73      retired  married  ...      1.028       4963.6  yes
41185   46  blue-collar  married  ...      1.028       4963.6   no
41186   56      retired  married  ...      1.028       4963.6   no
41187   44   technician  married  ...      1.028       4963.6  yes
41188   74      retired  married  ...      1.028       4963.6   no

[41189 rows x 21 columns]

In [ ]:
bank_ds2=pd.read_csv(url1,sep=';',skiprows=(1,2,3))

In [ ]:
bank_ds2

       age          job  marital  ... euribor3m nr.employed    y
0       40       admin.  married  ...     4.857      5191.0   no
1       56     services  married  ...     4.857      5191.0   no
2       45     services  married  ...     4.857      5191.0   no
3       59       admin.  married  ...     4.857      5191.0   no
4       41  blue-collar  married  ...     4.857      5191.0   no
...    ...          ...      ...  ...       ...         ...  ...
41180   73      retired  married  ...     1.028      4963.6  yes
41181   46  blue-collar  married  ...     1.028      4963.6   no
41182   56      retired  married  ...     1.028      4963.6   no
41183   44   technician  married  ...     1.028      4963.6  yes
41184   74      retired  married  ...     1.028      4963.6   no

[41185 rows x 21 columns]

In [ ]:
pd.options.display.max_rows = 10

In [ ]:
result = pd.read_csv('ex6.csv')
result.head(10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [ ]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
chunk = pd.read_csv('ex6.csv', chunksize=1000)
chunk

Writing Data to Text Format

In [ ]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
cat=data.to_csv('/content/kit.csv',sep='@')
cat1=pd.read_csv('kit.csv',sep='@')

In [ ]:
cat1.head()

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [ ]:
import sys
data.to_csv('out1.csv', sep='@')

In [ ]:
data.to_csv(sys.stdout, na_rep='man')

,something,a,b,c,d,message
0,one,1,2,3.0,4,man
1,two,5,6,man,8,world
2,three,9,10,11.0,12,foo

In [ ]:
data.to_csv('out2.csv', index=False, header=False)

In [ ]:
data.to_csv('out3.csv', index=False, columns=['a', 'b', 'c'])

In [ ]:
dates = pd.date_range('8/3/1996',periods=7,freq='Y')
dates

DatetimeIndex(['1996-12-31', '1997-12-31', '1998-12-31', '1999-12-31',
               '2000-12-31', '2001-12-31', '2002-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [ ]:
ts1=pd.Series(np.arange(7),index=dates,name='number')
ts1

1996-12-31    0
1997-12-31    1
1998-12-31    2
1999-12-31    3
2000-12-31    4
2001-12-31    5
2002-12-31    6
Freq: A-DEC, Name: number, dtype: int64

In [ ]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv(sys.stdout)

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

Working with Delimited Formats

In [ ]:
import csv
f = open('ex7.csv')

reader = csv.reader(f)
reader

In [ ]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [ ]:
header

['a', 'b', 'c']

In [ ]:
list(zip(*values))

[('1', '1'), ('2', '2'), ('3', '3')]

In [ ]:
list(zip(header,zip(*values)))

[('a', ('1', '1')), ('b', ('2', '2')), ('c', ('3', '3'))]

In [ ]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [ ]:
l1=[1,2,3]
l2=[2,3,4]
{a:b for a ,b in zip(l1,l2)}

{1: 2, 2: 3, 3: 4}

In [ ]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

JSON Data

In [ ]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [ ]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [ ]:
asjson = json.dumps(result)

In [ ]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [ ]:
!cat /Users/sudhanshukumar/Downloads/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [ ]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

XML and HTML: Web Scraping

In [ ]:
tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [ ]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()
#close_timestamps

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

# Binary Data Formats

In [ ]:
frame = pd.read_csv('ex1.csv')
frame
frame.to_pickle('frame_pickle')

In [ ]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Using HDF5 Format

In [ ]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [ ]:
store['obj1']

           a
0  -1.326543
1  -1.119274
2  -0.497229
3   1.415498
4  -0.545912
..       ...
95  1.331159
96  1.724165
97 -0.259413
98  0.491655
99  0.047230

[100 rows x 1 columns]

In [ ]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [ ]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.212260
1  1.438855
2 -0.426525
3  2.774679
4  1.090206

# Web APIs

In [ ]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [ ]:
data = resp.json()
data[0]

{'active_lock_reason': None,
 'assignee': None,
 'assignees': [],
 'author_association': 'CONTRIBUTOR',
 'body': '`.set_tooltips` and `.set_tooltips_class` are introduced to 1.3.0.\r\n\r\nJust realised it seems a bit pointless to have two api functions:\r\n\r\n- [x] remove `.set_tooltips_class()` and `._init_tooltips()`\r\n- [x] include the `css_name` and `props` arguments in `.set_tooltips` for same functionality.\r\n- [x] no api break since these functions have not yet been released\r\n- [x] make argument names more consistent with other Styler methods.',
 'closed_at': None,
 'comments': 0,
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/40284/comments',
 'created_at': '2021-03-07T07:35:29Z',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/40284/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/40284',
 'id': 823854411,
 'labels': [],
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/40284/labels{/name}',
 'locked': False,
 'milestone': None,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0NTg2MjA0NjMz',
 'number': 40284,
 'performed_via_github_app': None,
 'pull_request': {'diff_url': 'https://github.com/pandas-dev/pandas/pull/40284.diff',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/40284',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/40284.patch',
  'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/40284'},
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'state': 'open',
 'title': 'API: remove `.set_tooltips_class` incorpate to `.set_tooltips`',
 'updated_at': '2021-03-07T11:31:40Z',
 'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/40284',
 'user': {'avatar_url': 'https://avatars.githubusercontent.com/u/24256554?v=4',
  'events_url': 'https://api.github.com/users/attack68/events{/privacy}',
  'followers_url': 'https://api.github.com/users/attack68/followers',
  'following_url': 'https://api.github.com/users/attack68/following{/other_user}',
  'gists_url': 'https://api.github.com/users/attack68/gists{/gist_id}',
  'gravatar_id': '',
  'html_url': 'https://github.com/attack68',
  'id': 24256554,
  'login': 'attack68',
  'node_id': 'MDQ6VXNlcjI0MjU2NTU0',
  'organizations_url': 'https://api.github.com/users/attack68/orgs',
  'received_events_url': 'https://api.github.com/users/attack68/received_events',
  'repos_url': 'https://api.github.com/users/attack68/repos',
  'site_admin': False,
  'starred_url': 'https://api.github.com/users/attack68/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/attack68/subscriptions',
  'type': 'User',
  'url': 'https://api.github.com/users/attack68'}}

In [ ]:
import pandas as pd
for i in range(len(data)):
  data1.append(pd.DataFrame(data[i]['labels']))

In [ ]:
data1

           id  ...                                        description
0       76811  ...                                               None
1  1954720290  ...  Issue that has not been reviewed by a pandas t...

[2 rows x 7 columns]

In [ ]:
 issues2 = pd.DataFrame(data,columns=['id','node_id','url','name','color','default','description'])
issues2

           id                           node_id  ... default  description
0   823854411  MDExOlB1bGxSZXF1ZXN0NTg2MjA0NjMz  ...     NaN          NaN
1   823811022  MDExOlB1bGxSZXF1ZXN0NTg2MTc0NzQw  ...     NaN          NaN
2   823797663  MDExOlB1bGxSZXF1ZXN0NTg2MTY4MTUy  ...     NaN          NaN
3   823711612  MDExOlB1bGxSZXF1ZXN0NTg2MTEwOTQ0  ...     NaN          NaN
4   823708541  MDExOlB1bGxSZXF1ZXN0NTg2MTA4NzI5  ...     NaN          NaN
5   823705929  MDExOlB1bGxSZXF1ZXN0NTg2MTA2ODcw  ...     NaN          NaN
6   823693020  MDExOlB1bGxSZXF1ZXN0NTg2MDk3MzUy  ...     NaN          NaN
7   823673300          MDU6SXNzdWU4MjM2NzMzMDA=  ...     NaN          NaN
8   823668824          MDU6SXNzdWU4MjM2Njg4MjQ=  ...     NaN          NaN
9   823664367  MDExOlB1bGxSZXF1ZXN0NTg2MDc1OTk5  ...     NaN          NaN
10  823651356  MDExOlB1bGxSZXF1ZXN0NTg2MDY1ODQz  ...     NaN          NaN
11  823639310  MDExOlB1bGxSZXF1ZXN0NTg2MDU2NTc4  ...     NaN          NaN
12  823633326  MDExOlB1bGxSZXF1ZXN0NTg2MDUxOTQw  ...     NaN          NaN
13  823624196  MDExOlB1bGxSZXF1ZXN0NTg2MDQ1MDcx  ...     NaN          NaN
14  823550703          MDU6SXNzdWU4MjM1NTA3MDM=  ...     NaN          NaN
15  823504898  MDExOlB1bGxSZXF1ZXN0NTg1OTUzNTIx  ...     NaN          NaN
16  823483465  MDExOlB1bGxSZXF1ZXN0NTg1OTM1NTg3  ...     NaN          NaN
17  823390477          MDU6SXNzdWU4MjMzOTA0Nzc=  ...     NaN          NaN
18  823266131          MDU6SXNzdWU4MjMyNjYxMzE=  ...     NaN          NaN
19  823245877  MDExOlB1bGxSZXF1ZXN0NTg1NzM3MjU1  ...     NaN          NaN
20  823231449          MDU6SXNzdWU4MjMyMzE0NDk=  ...     NaN          NaN
21  823076498          MDU6SXNzdWU4MjMwNzY0OTg=  ...     NaN          NaN
22  822933415          MDU6SXNzdWU4MjI5MzM0MTU=  ...     NaN          NaN
23  822868841          MDU6SXNzdWU4MjI4Njg4NDE=  ...     NaN          NaN
24  822859511  MDExOlB1bGxSZXF1ZXN0NTg1NDE1MTAy  ...     NaN          NaN
25  822856378          MDU6SXNzdWU4MjI4NTYzNzg=  ...     NaN          NaN
26  822710682  MDExOlB1bGxSZXF1ZXN0NTg1MjkwNjEy  ...     NaN          NaN
27  822679307  MDExOlB1bGxSZXF1ZXN0NTg1MjY0ODA4  ...     NaN          NaN
28  822538599          MDU6SXNzdWU4MjI1Mzg1OTk=  ...     NaN          NaN
29  822516943          MDU6SXNzdWU4MjI1MTY5NDM=  ...     NaN          NaN

[30 rows x 7 columns]

# Interacting with Databases

In [ ]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [ ]:
db.commit()

In [ ]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [ ]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

(102, 'Gary', 90)
------------------------------------------------------------

In [ ]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [ ]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)